synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4cp/include/sam4cp16c_1.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2015, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM4CP16C_1_
#define _SAM4CP16C_1_

/** \addtogroup SAM4CP16C_definitions SAM4CP16C definitions
  This file defines all structures and symbols for SAM4CP16C:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM4CP16C */
/* ************************************************************************** */
/** \addtogroup SAM4CP16C_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  SAM4CP16C specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM4CP16C Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM4CP16C Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM4CP16C Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM4CP16C Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM4CP16C Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM4CP16C Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAM4CP16C Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  8, /**<  8 SAM4CP16C UART 0 (UART0) */
  
  PIOA_IRQn            = 11, /**< 11 SAM4CP16C Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM4CP16C Parallel I/O Controller B (PIOB) */
  USART0_IRQn          = 14, /**< 14 SAM4CP16C USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM4CP16C USART 1 (USART1) */
  USART2_IRQn          = 16, /**< 16 SAM4CP16C USART 2 (USART2) */
  USART3_IRQn          = 17, /**< 17 SAM4CP16C USART 3 (USART3) */
  USART4_IRQn          = 18, /**< 18 SAM4CP16C USART 4 (USART4) */
  TWI0_IRQn            = 19, /**< 19 SAM4CP16C Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 SAM4CP16C Two Wire Interface 1 (TWI1) */
  SPI0_IRQn            = 21, /**< 21 SAM4CP16C Serial Peripheral Interface 0 (SPI0) */
  TC0_IRQn             = 23, /**< 23 SAM4CP16C Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAM4CP16C Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAM4CP16C Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAM4CP16C Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAM4CP16C Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAM4CP16C Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 SAM4CP16C Analog To Digital Converter (ADC) */
  ARM1_IRQn            = 30, /**< 30 SAM4CP16C FPU signals: FPIXC, FPOFC, FPUFC, FPIOC, FPDZC, FPIDC, FPIXC (ARM1) */
  IPC0_IRQn            = 31, /**< 31 SAM4CP16C Interprocessor communication 0 (IPC0) */
  SLCDC_IRQn           = 32, /**< 32 SAM4CP16C Segment LCD Controller (SLCDC) */
  TRNG_IRQn            = 33, /**< 33 SAM4CP16C True Random Generator (TRNG) */
  ICM_IRQn             = 34, /**< 34 SAM4CP16C Integrity Check Module (ICM) */
  CPKCC_IRQn           = 35, /**< 35 SAM4C Public Key Cryptography Controller (CPKCC) */
  AES_IRQn             = 36, /**< 36 SAM4CP16C Advanced Enhanced Standard (AES) */
  PIOC_IRQn            = 37, /**< 37 SAM4CP16C Parallel I/O Controller C (PIOC) */
  UART1_IRQn           = 38, /**< 38 SAM4CP16C UART 1 (UART1) */
  IPC1_IRQn            = 39, /**< 39 SAM4CP16C Interprocessor communication 1 (IPC1) */
  SPI1_IRQn            = 40, /**< 40 SAM4CP16C Serial Peripheral Interface 1 (SPI1) */
  PWM_IRQn             = 41, /**< 41 SAM4CP16C Pulse Width Modulation (PWM) */

